import {BarChartData, PieChartData} from "../types/сhart";

export const colorPalette = [
    "rgb(244, 117, 96)",  // Синій
    "rgb(241, 225, 91)", // Зелений
    "rgb(102, 102, 255)",// Світло-синій
    "rgb(108,215,244)",  // Червоний
    "rgb(255, 167, 11)", // Помаранчевий
    "rgb(126,248,126)",// Персиковий
    "rgb(147, 112, 219)",// Фіолетовий
    "rgb(255, 215, 0)",  // Жовтий
    "rgb(57,156,227)",// Світло-блакитний
    "rgb(144, 238, 144)",// Світло-зелений
    "rgb(64, 224, 208)", // Бірюзовий
    "rgb(238, 130, 238)",// Світло-фіолетовий
    "rgb(255, 160, 122)", // Світло-кораловий
    "rgb(0, 128, 0)", // Зелений
    "rgb(128, 0, 128)", // Пурпурний
    "rgb(56 189 178)", // Лайм
    "rgb(210, 105, 30)", // Шоколадний
    "rgb(255, 69, 0)", // Темно-оранжевий
    "rgb(60, 179, 113)", // Середній морський хвилі
    "rgb(199, 21, 133)", // Середній фіолетово-червоний
    "rgb(32, 178, 170)", // Світло-морський хвилі
    "rgb(112, 128, 144)", // Сіро-блакитний
    "rgb(255, 105, 180)", // Гарячий рожевий
    "rgb(255, 248, 220)", // Кукурудзяний крем
    "rgb(0, 0, 255)", // Синій
    "rgb(255, 20, 147)", // Рожевий
];

export const mockPieData = [
    {
        id: 'First category',
        name: 'First',
        amount: 1,
    },
    {
        id: 'Second category',
        name: 'Second',
        amount: 2,
    },
    {
        id: 'Third category',
        name: 'Third',
        amount: 3,
    }
]

export const mockBarData: BarChartData[] = [
    {
        date: '01-01',
        'First': 1,
        'Second': 2,
        'Third': 3
    },
    {
        date: '02-01',
        'First': 1,
        'Second': 2,
        'Third': 3
    },
    {
        date: '03-01',
        'First': 1,
        'Second': 2,
        'Third': 3
    },
]